erickfunier/STM32_Display_TFT/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */
  begin(0x1289);
  HAL_ADC_Start_DMA(&hadc1,(uint32_t*)ADC_BUF,3);
  //HAL_ADC_Start_IT(&hadc1);
  //HAL_TIM_Base_Start_IT(&htim2);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	  //fillScreen(GREEN);
	  //if(!run) calibrateTouch();
	  //testDrawScreen();
	  if (!run){
		  drawFrame();
		  HAL_TIM_Base_Start_IT(&htim2);
		  run = true;
	  }
	  HAL_Delay(75);
	  readTouch();
	  //drawPixel(40, 10, RED);
	  //drawPixel(80, 20, RED);
	  //drawPixel(209, 310, RED);

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
	htim2.Instance->CR1 &= ~TIM_CR1_CEN; // pause tim
	drawWave(5,200,altura);
	htim2.Instance->CR1 |= TIM_CR1_CEN;  // resume tim
}

/*void drawAxis(uint8_t x_axis, uint8_t y_axis, uint16_t color, uint8_t div_x, uint8_t div_y){
	for(int8_t i=0; i < 320; i++){
		drawPixel(i, y_axis, color);
	}
	for(int8_t i=0; i < WIDTH; i++){
		drawPixel(x_axis, i, color);
	}
}*/

void drawFrame(){
		setCursor(280, 20);
		setTextColor(BLUE, GREEN);
		setTextSize(4);
		print("U");
		drawRect(15, 270, 40, 40, BLUE);

		setCursor(280, 80);
		setTextColor(RED, GREEN);
		setTextSize(4);
		print("D");
		drawRect(75, 270, 40, 40, RED);

		setCursor(280, 140);
		setTextColor(CYAN, GREEN);
		setTextSize(4);
		print("T");
		drawRect(135, 270, 40, 40, CYAN);

		setCursor(280, 200);
		setTextColor(WHITE, GREEN);
		setTextSize(4);
		print("S");
		drawRect(195, 270, 40, 40, WHITE);
}


void drawWave(uint8_t x_pos, uint8_t y_pos, uint8_t altura) {
	readLDR(altura);
	//wave[x_wave] = milliVolt_ldr;
	fillRect(x_wave, (y_pos-milliVolt_ldr<0?0:y_pos-milliVolt_ldr), 4, 4, BLUE);
	if(++x_wave >= 245){
		x_wave = x_pos;
		//Limpa tela e pausa timer
		htim2.Instance->CR1 &= ~TIM_CR1_CEN; // pause tim
		fillRect(0, 0, 260, y_pos+5, GREEN);
		htim2.Instance->CR1 |= TIM_CR1_CEN;  // resume tim
	}
}

void readLDR(uint8_t altura) {
		flag_adc = 1;
		HAL_ADC_Start_IT(&hadc1);
		while(!flag_adc);
		ldr_atual = val_adc3;

	milliVolt_ldr = (ldr_atual*3300/4095)/altura;
}

bool ISPRESSED(void)
{
    // .kbv this was too sensitive !!
    // now touch has to be stable for 50ms
    int count = 0;
    bool state, oldstate = false;
    readTouchZ();
    while (count < 10) {
        if (flag_adc == 0) {
        	touchz_atual = (4096 - (val_adc1 - val_adc2));
			state = touchz_atual > 200;     //ADJUST THIS VALUE TO SUIT YOUR SCREEN e.g. 20 ... 250
			if (state == oldstate) count++;
			else count = 0;
			oldstate = state;
			readTouchZ();
        } else {
        	HAL_Delay(1);
        }
    }
    return oldstate;
}

void readTouch(){
	char resultx[50];
	char resulty[50];
	int samples = 20;
	int temp = 0;

	readTouchX();
	for (int i = 0; i < samples; i++) {
		if (flag_adc == 0) {
			temp += val_adc1;
			readTouchX();
		} else {
			i--;
		}
	}
	touchx_atual = temp/samples;

	sprintf(resultx, "%i", touchx_atual);

	fillRect(40, 148, 80, 18, GREEN);

	setCursor(40, 148);
	setTextSize(2);
	print(resultx);

	flag_adc = 1;
	temp = 0;

	readTouchY();
	for (int i = 0; i < samples; i++) {
		if (flag_adc == 0) {
			temp += val_adc2;
			readTouchY();
		} else {
			i--;
		}
	}
	touchy_atual = temp/samples;

	sprintf(resulty, "%i", touchy_atual);

	fillRect(154, 148, 80, 18, GREEN);

	setCursor(154, 148);
	setTextSize(2);
	print(resulty);

	//Aumenta escala
	if(ISPRESSED() && touchx_atual > 240 && touchx_atual < 500 && touchy_atual > 20 && touchy_atual < 120){
		(altura -= 5) <= 5?altura = 5:"";

		//Limpa tela e pausa timer
		htim2.Instance->CR1 &= ~TIM_CR1_CEN; // pause tim
		fillRect(0, 0, 260, y_pos+5, GREEN);
		htim2.Instance->CR1 |= TIM_CR1_CEN;  // resume tim
	}
	//Diminui escala
	if(ISPRESSED() && touchx_atual > 180 && touchx_atual < 360 && touchy_atual > 70 && touchy_atual < 180){
		altura += 5;

		//Limpa tela e pausa timer
		htim2.Instance->CR1 &= ~TIM_CR1_CEN; // pause tim
		fillRect(0, 0, 260, y_pos+5, GREEN);
		htim2.Instance->CR1 |= TIM_CR1_CEN;  // resume tim
	}
	//Aumenta base de tempo
	if(ISPRESSED() && touchx_atual > 121 && touchx_atual < 270 && touchy_atual > 100 && touchy_atual < 210){
		base_tempo += 10;
		TIM2 -> ARR = base_tempo;

		//Limpa tela e pausa timer
		htim2.Instance->CR1 &= ~TIM_CR1_CEN; // pause tim
		fillRect(0, 0, 260, y_pos+5, GREEN);
		htim2.Instance->CR1 |= TIM_CR1_CEN;  // resume tim
	}
	//Diminui base de tempo
	if(ISPRESSED() && touchx_atual > 20 && touchx_atual < 120 && touchy_atual > 100 && touchy_atual < 200){
		(base_tempo -= 10) <= 10?base_tempo = 10:"";
		TIM2 -> ARR = base_tempo;

		//Limpa tela e pausa timer
		htim2.Instance->CR1 &= ~TIM_CR1_CEN; // pause tim
		fillRect(0, 0, 260, y_pos+5, GREEN);
		htim2.Instance->CR1 |= TIM_CR1_CEN;  // resume tim
	}
}

void readTouchX() {
	wr_analog_input(); //_yp
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_SET);
	rs_cmd(); //_ym LOW

	flag_adc = 1;
	HAL_ADC_Start_IT(&hadc1);
}

void readTouchY() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
	rs_cmd();
	rs_analog_input(); //_yp

	wr_idle(); //_yp HIGH
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_RESET);

	flag_adc = 1;
	HAL_ADC_Start_IT(&hadc1);
}

void readTouchZ() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_SET);
	rs_cmd();
	rs_analog_input();
	wr_active();
	wr_analog_input();

	flag_adc = 1;
	HAL_ADC_Start_IT(&hadc1);
}

void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

