erickfunier/STM32_Display_TFT/main.c
	setCursor(154, 148);
	setTextSize(2);
	print(resulty);

	fillRect(240, 120, 11, 11, RED);

	x2 = 240 + 11/2; // Ponto X2 + Largura do ponto
	y2 = 120 + 11/2; // Ponto Y2 + Largura do ponto

	f_touch = 0;
	temp = 0;
	val_adc2 = 0;
	while (f_touch == 0) {
		for (int i = 0; i < samples; i++) {
			readTouchY();
			if (flag_adc == 0) {
				temp += val_adc2;
			} else {
				i--;
			}
		}
		temp = temp/samples;
		if (ISPRESSED()) f_touch = 1;
	}

	for (int i = 0; i < 20; i++) {
		readTouchX();
		if (flag_adc == 0) {
			temp += val_adc1;
		}
	}
	touchx2 = temp/samples;

	sprintf(resultx, "%i", touchx2);

	fillRect(40, 148, 80, 18, GREEN);

	setCursor(40, 148);
	setTextSize(2);
	print(resultx);

	temp = 0;
	for (int i = 0; i < samples; i++) {
		readTouchY();
		if (flag_adc == 0) {
			temp += val_adc2;
		}
	}
	touchy2 = temp/samples;

	sprintf(resulty, "%i", touchy2);

	fillRect(154, 148, 80, 18, GREEN);

	setCursor(154, 148);
	setTextSize(2);
	print(resulty);

	fillRect(20, 200, 11, 11, RED);

	x3 = 20 + 11/2; // Ponto X3 + Largura do ponto
	y3 = 200 + 11/2; // Ponto Y3 + Largura do ponto

	f_touch = 0;
	temp = 0;
	val_adc1 = 0;
	while (f_touch == 0) {
		for (int i = 0; i < samples; i++) {
			readTouchX();
			if (flag_adc == 0) {
				temp += val_adc1;
			} else {
				i--;
			}
		}
		temp = temp/samples;
		if (ISPRESSED()) f_touch = 1;
	}

	for (int i = 0; i < samples; i++) {
		readTouchX();
		if (flag_adc == 0) {
			temp += val_adc1;
		}
	}
	touchx3 = temp/samples;

	sprintf(resultx, "%i", touchx3);

	fillRect(40, 148, 80, 18, GREEN);

	setCursor(40, 148);
	setTextSize(2);
	print(resultx);

	temp = 0;
	for (int i = 0; i < samples; i++) {
		readTouchY();
		if (flag_adc == 0) {
			temp += val_adc2;
		}
	}
	touchy3 = temp/samples;

	sprintf(resulty, "%i", touchy3);

	fillRect(154, 148, 80, 18, GREEN);

	setCursor(154, 148);
	setTextSize(2);
	print(resulty);

	int A[3][3] =
	{
		{touchx1,touchy1,1}  ,
		{touchx2,touchy2,1}  ,
		{touchx3,touchy3,1}
	};

	for(int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			if (i == j) {
				ident[i][j] = 1;
			}
			else {
				ident[i][j] = 0;
			}
		}
	}

	for (int j = 0; j < 3; j++) {
		for (int k = 0; k < 3; k++) {
			A[j][k] = A[j][k]/A[j][j];
			ident[j][k] = ident[j][k]/A[j][j];
		}

		for (int i = 0; i < 3; i++) {
			if (i != j) {
				for (int k = 0; k < 3; k++) {
					A[j][k] = A[i][k] - (A[i][j] * A[j][k]);
					ident[i][k] = ident[i][k] - (A[i][j] * ident[j][k]);
				}
			}
		}
	}

	sprintf(resultx, "%i", touchx1);

	setCursor(30, 40);
	setTextSize(2);
	print(resultx);

	sprintf(resultx, "%i", touchy1);

	setCursor(60, 40);
	setTextSize(2);
	print(resultx);

	sprintf(resultx, "%i", touchx2);

	setCursor(90, 40);
	setTextSize(2);
	print(resultx);

	sprintf(resulty, "%i", touchy2);

	setCursor(30, 80);
	setTextSize(2);
	print(resulty);

	sprintf(resulty, "%i", touchx3);

	setCursor(80, 80);
	setTextSize(2);
	print(resulty);

	sprintf(resulty, "%i", touchy3);

	setCursor(120, 80);
	setTextSize(2);
	print(resulty);
	*/
}

void setRotation(uint8_t r) {
	uint16_t GS, SS_v, ORG, REV = _lcd_rev;
	uint8_t val;
    rotation = r & 3;           // just perform the operation ourselves on the protected variables
    if (rotation & 1) {
    	HEIGHT = _WIDTH;
    	WIDTH = _HEIGHT;
    }
    switch (rotation) {
    case 0:                    //PORTRAIT:
        val = 0x48;             //MY=0, MX=1, MV=0, ML=0, BGR=1
        break;
    case 1:                    //LANDSCAPE: 90 degrees
        val = 0x28;             //MY=0, MX=0, MV=1, ML=0, BGR=1
        break;
    case 2:                    //PORTRAIT_REV: 180 degrees
        val = 0x98;             //MY=1, MX=0, MV=0, ML=1, BGR=1
        break;
    case 3:                    //LANDSCAPE_REV: 270 degrees
        val = 0xF8;             //MY=1, MX=1, MV=1, ML=1, BGR=1
        break;
    }
	_MC = 0x4E, _MP = 0x4F, _MW = 0x22, _SC = 0x44, _EC = 0x44, _SP = 0x45, _EP = 0x46;
    if (rotation & 1)
    	val ^= 0xD0;    // exchange Landscape modes
	GS = (val & 0x80) ? (1 << 14) | (1 << 12) : 0;      //called TB (top-bottom)
	SS_v = (val & 0x40) ? (1 << 9) : 0;   //called RL (right-left)
	ORG = (val & 0x20) ? (1 << 3) : 0;  //called AM
	_lcd_drivOut = GS | SS_v | (REV << 13) | 0x013F;      //REV=0, BGR=0, MUX=319
	if (val & 0x08)
		_lcd_drivOut |= 0x0800; //BGR
	writeCmdData(0x01, _lcd_drivOut);   // set Driver Output Control
	writeCmdData(0x11, ORG | 0x6070);   // set GRAM write direction.

    if ((rotation & 1) && ((_lcd_capable & MV_AXIS) == 0)) {
        uint16_t x;
        x = _MC, _MC = _MP, _MP = x;
        x = _SC, _SC = _SP, _SP = x;    //.kbv check 0139
        x = _EC, _EC = _EP, _EP = x;    //.kbv check 0139
    }
    setAddrWindow(0, 0, WIDTH - 1, HEIGHT - 1);
    vertScroll(0, HEIGHT, 0);   //reset scrolling after a rotation
}

void setCursor(int16_t x, int16_t y) {
	cursor_x = x;
	cursor_y = y;
}

void setTextColor(uint16_t color, uint16_t txtbgcolor) {
	textcolor = color;
	textbgcolor = txtbgcolor;
}

void setTextSize(uint8_t size) {
	textsize = (size > 0) ? size : 1;
}

void print(char c[]) {
	size_t n = strlen(c);
	for (size_t i = 0; i < n; i++) {
		write(c[i]);
	}
}

void write(uint8_t c) {
    if(c == '\n') {                        // Newline?
        cursor_x  = 0;                     // Reset x to zero,
        cursor_y += textsize * 8;          // advance y one line
    } else if(c != '\r') {                 // Ignore carriage returns
        if(wrap && ((cursor_x + textsize * 6) > _width)) { // Off right?
            cursor_x  = 0;                 // Reset x to zero,
            cursor_y += textsize * 8;      // advance y one line
        }
        drawChar(WIDTH, HEIGHT, cursor_x, cursor_y, c, textcolor, textbgcolor, textsize);
        cursor_x += textsize * 6;          // Advance x one char
    }
}

void drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
	drawHLine(x, y, w, color);
	drawHLine(x, y+h-1, w, color);
	drawVLine(x, y, h, color);
	drawVLine(x+w-1, y, h, color);
}

void drawHLine(int16_t x, int16_t y, int16_t w, uint16_t color) {
	for(int i = 0; i < w; i++) {
		drawPixel(x+i, y, color);
	}
}

